[{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539452\/Your_Guide_to_Patch_150_Arcade-31_07_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for. Meanwhile, the StarCraft menu has consolidated all the competitive and cooperative StarCraft II gameplay you’re familiar with into one easy to navigate place. With the new Battle.net UI, menus are now easier and faster to navigate, and a suite of new Editor tools provide game creators the power to bring their visions to life like never before.","sourceType":"Blizzard"},{"title":"What You Need to Know About Patch 1.5.0","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539446\/What_You_Need_to_Know_About_Patch_150-31_07_2012","postedDate":1343692800,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster.","sourceType":"Blizzard"},{"title":"World Championship Series - Nordic Nationals","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5338430\/World_Championship_Series_-_Nordic_Nationals-28_07_2012","postedDate":1343433600,"content":"After the upcoming Russian Federation and Ukraine Nationals, the next national event in the StarCraft II World Championship Series takes place in Stockholm, Sweden on July 28. The line-up will include the top Swedish, Danish, Norwegian, and Finnish StarCraft II players, who’ll be battling their countrymen for a share of the $30,000 USD prize pool and some coveted slots in the Europe Finals in September.","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5549687\/WCS_Singapore_Nationals_this_Weekend-28_07_2012","postedDate":1343433600,"content":"On July 28-29 Singapore's top players will face off in the StarCraft II World Championship Series (WCS) Singapore Nationals. 64 players will battle it out through the on-site qualifier tournaments on Day 1, then the remaining 16 players will battle for the honor of representing Singapore at the Asia Finals on Day 2. With a $10,000 prize pool, this is the biggest StarCraft II event Singapore has ever seen!&#160;","sourceType":"Blizzard"},{"title":"TSL4 Begins","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539450\/TSL4_Begins-28_07_2012","postedDate":1343433600,"content":"It’s finally here. The qualifiers have run, the bracket has been revealed, and now the Team Liquid Starleague 4 Round of 32 kicks off this weekend. With an all-star lineup full of international champions and up-and-comers, and broadcast by some of the best casters in the business, the TSL4 is most definitely going to be an event to keep your eyes on.","sourceType":"Blizzard"},{"title":"WCS Nordic Player Spotlight: EG.ThorZaIN and MorroW","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539449\/WCS_Nordic_Player_Spotlight_EGThorZaIN_and_MorroW-27_07_2012","postedDate":1343347200,"content":"The Nordic Nationals this weekend are looking to be one of the most exciting events of the year. The level of talent is absolutely staggering, with several world-class players fighting for a limited number of spots at the Europe Finals. We got a chance to chat with two such players, Marcus “EG.ThorZaIN” Elköf and Stefan “MorroW” Anderson, and find out their thoughts going into the event.","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5543450\/eSports_Upcoming_Tournaments-27_07_2012","postedDate":1343347200,"content":"Various competition organizers hold regular online tournaments in which you can compete against other players and maybe even win some prizes! Most of these contests are open to everyone. In addition, there are professional tournaments taking place like the WCS Nordic Nationals which you can follow via video stream.","sourceType":"Blizzard"},{"title":"Election Day for the Protoss President: GSL Finals Preview","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5542549\/Election_Day_for_the_Protoss_President_GSL_Finals_Preview-27_07_2012","postedDate":1343347200,"content":"This weekend, both the Global StarCraft II League (GSL) and the Global StarCraft II Team League (GSTL) will conclude in an epic ocean-side clash at Haeundae Beach in Busan, South Korea.&#160; First, Jang “SK.MC” Min Chul will seek his third GSL title, but the brilliant upstart and comeback king LG-IM.Seed looks to establish himself as the protoss counterpart to his teammates NesTea and Mvp. The action begins this Friday at 12:10 PM CEST!","sourceType":"Blizzard"},{"title":"We &lt;3 BarCraft - August 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5536795\/We_3_BarCraft_-_August_2012-26_07_2012","postedDate":1343260800,"content":"Are you interested in joining other eSports enthusiasts to watch a live stream of intense professional StarCraft II action? Check out the following list to see if there's an event being organized in your area!","sourceType":"Blizzard"},{"title":"Blizzard Activities Confirmed for gamescom 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5487905\/Blizzard_Activities_Confirmed_for_gamescom_2012-26_07_2012","postedDate":1343260800,"content":"It’s nearly time for gamescom 2012, and we hope you’re as excited as we are for the slew of awesome activities we have in store for you at the Blizzard booth!","sourceType":"Blizzard"},{"title":"GameSpot eSports Wrap Up: Interviews and More","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5535102\/GameSpot_eSports_Wrap_Up_Interviews_and_More-26_07_2012","postedDate":1343260800,"content":"Our friends over at GameSpot have been ramping up their coverage of eSports this year. They’ve done some great interviews at all the major eSports events, which we’ve collected for you here! How does Scarlett feel about her win at WCS Canada? Why did MLG decide to abandon their Pay Per View model? And what’s going on with the documentary about Tasteless and Artosis? Find out answers to all these questions and more.","sourceType":"Blizzard"}]