[{"title":"WCS - México Nationals","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5572534\/WCS_-_M%C3%A9xico_Nationals-04_08_2012","postedDate":1344038400,"content":"The top StarCraft II players in Mexico will face off in the StarCraft II World Championship Series (WCS) Mexico Nationals. Players battled through on-site qualifier tournaments in different states of Mexico to earn the right to fight at the Nationals. The best of the best will be competing for honor and glory, and the top six will represent their country at the&#160;North America Finals, which will be held on August 24-26 in Raleigh, North Carolina!","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5586691\/eSports_Upcoming_Tournaments-03_08_2012","postedDate":1343952000,"content":"Take a look at some of the open tournaments coming up in the next days - you can sign up to take part, or simply watch the live streams to get inspired by the players. It’s your turn now!","sourceType":"Blizzard"},{"title":"WCS – Four New Champions Crowned in the Nordic Nationals","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5580016\/WCS_%E2%80%93_Four_New_Champions_Crowned_in_the_Nordic_Nationals_-03_08_2012","postedDate":1343952000,"content":"The top Norwegian, Danish, Finnish, and Swedish StarCraft II players gathered in Stockholm, Sweden on July 28 for the StarCraft II World Championship Series (WCS) Nordic Nationals. Each of the 28 competitors battled their countrymen for a share of the $30,000 USD prize pool and one of six slots in the WCS Europe Finals in September.","sourceType":"Blizzard"},{"title":"WCS South Korea Nationals Coming","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5579665\/WCS_South_Korea_Nationals_Coming-03_08_2012","postedDate":1343952000,"content":"One of the most anticipated StarCraft II World Championship Series (WCS) events is almost here! The South Korea Nationals will be held August 6 - 24, and a total of 32 players will vie for one of only 10 slots to represent South Korea in the WCS Asia Finals.&#160;","sourceType":"Blizzard"},{"title":"We &lt;3 BarCraft - August 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5536795\/We_3_BarCraft_-_August_2012-02_08_2012","postedDate":1343865600,"content":"Are you interested in joining other eSports enthusiasts to watch a live stream of intense professional StarCraft II action? Check out the following list to see if there's an event being organized in your area!","sourceType":"Blizzard"},{"title":"Assembly Summer 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5580014\/Assembly_Summer_2012-02_08_2012","postedDate":1343865600,"content":"This weekend, 32 players will clash in Finland at the 4th ASUS ROG StarCraft II tournament: Assembly Summer 2012. Featuring an all-star production crew and a mix of players that includes the international debut of World Championship Series USA representative Conan&#160;\"EGSuppy\"&#160;Liu and UK representative Paul&#160;\"d.JonnyREcco\"&#160;Whyte, Assembly Summer 2012 should be exactly what you need to scratch the eSports itch.","sourceType":"Blizzard"},{"title":"The Crowning Event: OGN Starleague&#39;s Brood War Finals","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5579662\/The_Crowning_Event_OGN_Starleagues_Brood_War_Finals-02_08_2012","postedDate":1343865600,"content":"Thirteen years of history. Thirteen years of stories. Thirteen years of Brood War. It’s all led up to this single match. Heo “JangBi” Yeong Moo and Jung “Fantasy” Myung Hoon will face each other in the first and only repeat finals in Starleague history, for the honor of being the last Brood War Starleague champion. Fittingly, this finale will kick off with a revival of the original eSports rivalry: a Legends Match between Lim “BoxeR” Yo Hwan and Hong “YellOw” Jin Ho.","sourceType":"Blizzard"},{"title":"Patch 1.5.0 Now Live","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5571710\/Patch_150_Now_Live_-01_08_2012","postedDate":1343779200,"content":"","sourceType":"Blizzard"},{"title":"StarCraft II Language Changed after Patching","url":"http:\/\/eu.battle.net\/sc2\/en\/\/support\/en\/blog\/5571709\/StarCraft_II_Language_Changed_after_Patching-01_08_2012","postedDate":1343779200,"content":"If you experience an issue in StarCraft II where your interface language has changed, or if you are receiving an error that says “an authorized language pack is required” after the 1.5.0 patch, it is likely that your original language settings were overwritten during the patch process. We are aware of this issue and are working on a resolution at this time.","sourceType":"Blizzard"},{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539452\/Your_Guide_to_Patch_150_Arcade-31_07_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for. Meanwhile, the StarCraft menu has consolidated all the competitive and cooperative StarCraft II gameplay you’re familiar with into one easy to navigate place. With the new Battle.net UI, menus are now easier and faster to navigate, and a suite of new Editor tools provide game creators the power to bring their visions to life like never before.","sourceType":"Blizzard"},{"title":"What You Need to Know About Patch 1.5.0","url":"http:\/\/eu.battle.net\/sc2\/en\/blog\/5539446\/What_You_Need_to_Know_About_Patch_150-31_07_2012","postedDate":1343692800,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster.","sourceType":"Blizzard"},{"title":"World Championship Series - Nordic Nationals","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5338430\/World_Championship_Series_-_Nordic_Nationals-28_07_2012","postedDate":1343433600,"content":"After the upcoming Russian Federation and Ukraine Nationals, the next national event in the StarCraft II World Championship Series takes place in Stockholm, Sweden on July 28. The line-up will include the top Swedish, Danish, Norwegian, and Finnish StarCraft II players, who’ll be battling their countrymen for a share of the $30,000 USD prize pool and some coveted slots in the Europe Finals in September.","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5549687\/WCS_Singapore_Nationals_this_Weekend-28_07_2012","postedDate":1343433600,"content":"On July 28-29 Singapore's top players will face off in the StarCraft II World Championship Series (WCS) Singapore Nationals. 64 players will battle it out through the on-site qualifier tournaments on Day 1, then the remaining 16 players will battle for the honor of representing Singapore at the Asia Finals on Day 2. With a $10,000 prize pool, this is the biggest StarCraft II event Singapore has ever seen!&#160;","sourceType":"Blizzard"},{"title":"TSL4 Begins","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5539450\/TSL4_Begins-28_07_2012","postedDate":1343433600,"content":"It’s finally here. The qualifiers have run, the bracket has been revealed, and now the Team Liquid Starleague 4 Round of 32 kicks off this weekend. With an all-star lineup full of international champions and up-and-comers, and broadcast by some of the best casters in the business, the TSL4 is most definitely going to be an event to keep your eyes on.","sourceType":"Blizzard"},{"title":"WCS Nordic Player Spotlight: EG.ThorZaIN and MorroW","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5539449\/WCS_Nordic_Player_Spotlight_EGThorZaIN_and_MorroW-27_07_2012","postedDate":1343347200,"content":"The Nordic Nationals this weekend are looking to be one of the most exciting events of the year. The level of talent is absolutely staggering, with several world-class players fighting for a limited number of spots at the Europe Finals. We got a chance to chat with two such players, Marcus “EG.ThorZaIN” Elköf and Stefan “MorroW” Anderson, and find out their thoughts going into the event.","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5543450\/eSports_Upcoming_Tournaments-27_07_2012","postedDate":1343347200,"content":"Various competition organizers hold regular online tournaments in which you can compete against other players and maybe even win some prizes! Most of these contests are open to everyone. In addition, there are professional tournaments taking place like the WCS Nordic Nationals which you can follow via video stream.","sourceType":"Blizzard"},{"title":"Election Day for the Protoss President: GSL Finals Preview","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5542549\/Election_Day_for_the_Protoss_President_GSL_Finals_Preview-27_07_2012","postedDate":1343347200,"content":"This weekend, both the Global StarCraft II League (GSL) and the Global StarCraft II Team League (GSTL) will conclude in an epic ocean-side clash at Haeundae Beach in Busan, South Korea.&#160; First, Jang “SK.MC” Min Chul will seek his third GSL title, but the brilliant upstart and comeback king LG-IM.Seed looks to establish himself as the protoss counterpart to his teammates NesTea and Mvp. The action begins this Friday at 12:10 PM CEST!","sourceType":"Blizzard"},{"title":"Blizzard Activities Confirmed for gamescom 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5487905\/Blizzard_Activities_Confirmed_for_gamescom_2012-26_07_2012","postedDate":1343260800,"content":"It’s nearly time for gamescom 2012, and we hope you’re as excited as we are for the slew of awesome activities we have in store for you at the Blizzard booth!","sourceType":"Blizzard"},{"title":"GameSpot eSports Wrap Up: Interviews and More","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5535102\/GameSpot_eSports_Wrap_Up_Interviews_and_More-26_07_2012","postedDate":1343260800,"content":"Our friends over at GameSpot have been ramping up their coverage of eSports this year. They’ve done some great interviews at all the major eSports events, which we’ve collected for you here! How does Scarlett feel about her win at WCS Canada? Why did MLG decide to abandon their Pay Per View model? And what’s going on with the documentary about Tasteless and Artosis? Find out answers to all these questions and more.","sourceType":"Blizzard"},{"title":"1.5.0 Arcade Beta is Coming to a Close!","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5535101\/150_Arcade_Beta_is_Coming_to_a_Close_-26_07_2012","postedDate":1343260800,"content":"Your chance to help test the Patch 1.5.0 Arcade Beta is coming to a close! Your feedback on the 1.5.0 experience, including the Arcade&#160;and&#160;multiplayer, will help ensure that everything runs as smoothly as possible with the official release of Patch 1.5.0. If you’re not already familiar with it, The Patch 1.5.0 Beta introduces a slew of exciting new features, including the Arcade, improved UI, a new streaming client to reduce patching times, powerful new Editor tools and more.","sourceType":"Blizzard"},{"title":"WCS - Victory in Kiev for TitaN and Bly","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2blog\/5487909\/WCS_-_Victory_in_Kiev_for_TitaN_and_Bly-25_07_2012","postedDate":1343174400,"content":"Russia’s top sixteen StarCraft II players, along with Ukraine’s top eight, gathered in Kiev, Ukraine on July 21 and 22 for the StarCraft II World Championship Series (WCS) Russian Federation and Ukraine Nationals. The epic and intense battles decided which players would be worthy of representing their countries in the WCS Europe Finals in September.","sourceType":"Blizzard"},{"title":"Mists of Pandaria Launches September 25, 2012 – Pre-Sales NOW OPEN","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=2\/wow\/en\/blog\/5487908\/Mists_of_Pandaria_Launches_September_25_2012_%E2%80%93_Pre-Sales_NOW_OPEN-25_07_2012","postedDate":1343174400,"content":"Heroes of Azeroth, prepare to embark for an exotic new frontier! World of Warcraft: Mists of Pandaria is launching on September 25, 2012, and you can be ready to play when the servers go live by pre-purchasing the game digitally. Plus, for the first time ever, players will have the option to upgrade a pre-purchase to the all-new Digital Deluxe Edition, which comes with all of the in-game items from the retail Collector’s Edition.","sourceType":"Blizzard"},{"title":"IPL Update: Last Teams Standing","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5519890\/IPL_Update_Last_Teams_Standing-24_07_2012","postedDate":1343088000,"content":"It all comes down to this. We started the Team Arena Challenge with 24 of StarCraft II’s best teams from around the world. Now, only seven are left standing: SlayerS, Incredible Miracle, Liquid, MVP, StarTale, Evil Geniuses, and Prime. By the end of this week, only two will remain. Who will seize their berth to the live Grand Finals in San Francisco?","sourceType":"Blizzard"},{"title":"WCS - China Nationals Recap","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5519888\/WCS_-_China_Nationals_Recap-24_07_2012","postedDate":1343088000,"content":"The StarCraft II World Championship Series (WCS) China Nationals brought together the top sixteen Chinese StarCraft II players for the 2012 CCG EXPO in Shanghai, Friday, July 13-15. The top ten earned spots to represent China at the WCS Asia Finals and compete with players from Korea, Taiwan, and Singapore.\r\n  \r\n  Find out what went down!","sourceType":"Blizzard"},{"title":"WCS - Korea Offline Preliminaries July 22-23","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5458056\/WCS_-_Korea_Offline_Preliminaries_July_22-23-20_07_2012","postedDate":1342742400,"content":"One of the most anticipated World Championship Series (WCS) events, the Korea National Finals, are quickly approaching. The offline preliminaries for the event will be held on July 22 and 23, and will be broadcast by GOMTV. This event is going to be special, though: eSports superstars from all leagues, including KeSPA’s ProLeague, Ongamenet’s Starleague, and GomTV’s GSL and GSTL will take part in the WCS for the first time to determine who will represent Korea at the Battle.net World Championship in Shanghai later this year.","sourceType":"Blizzard"},{"title":"WCS - Russian Federation and Ukraine Nationals","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5435612\/WCS_-_Russian_Federation_and_Ukraine_Nationals-20_07_2012","postedDate":1342742400,"content":"The next national event in the&#160;StarCraft II World Championship Series&#160;takes place July 21 and 22 at the CyberSport Arena in Kiev, Ukraine. The line-up will include the top eight Ukrainian and top 16 Russian StarCraft II players. They’ll be fighting it out not only for fantastic prize pools of $5,000 USD and $15,000 USD respectively, but also for two Ukrainian and three Russian slots in the Europe Finals.","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5487904\/eSports_Upcoming_Tournaments-20_07_2012","postedDate":1342742400,"content":"Various competition organizers hold regular online tournaments in which you can compete against other players and maybe even win some prizes! Most of these contests are open to everyone. In addition, there are professional tournaments taking place like the World Championship Series Russian Federation &#38; Ukraine Nationals and the 2012 MLG Summer Arena which you can follow via video stream. Interested?","sourceType":"Blizzard"},{"title":"WCS - Taiwan Nationals Conclude Tonight","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5458055\/WCS_-_Taiwan_Nationals_Conclude_Tonight-20_07_2012","postedDate":1342742400,"content":"The World Championship Series Taiwan Nationals have nearly concluded, and the top nine players have earned their seed to the Asia Continentals. However, the Grand Final has yet to be played. GamaniaSen and TtApolloAK still have to fight it out for the chance to earn a direct seed to the Battle.net World Championships.","sourceType":"Blizzard"},{"title":"MLG Summer Arena Now Live","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5487900\/MLG_Summer_Arena_Now_Live-19_07_2012","postedDate":1342656000,"content":"The MLG summer season is kicking off with the Summer Arena this weekend. The Arenas have always provided the highest density of top-quality games, full of Korean stars and Western heroes. In past seasons they have been Pay per View, but thanks to a partnership with Full Sail University, MLG is now offering the stream for free!","sourceType":"Blizzard"},{"title":"We &lt;3 Barcraft - July 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5280250\/We_3_Barcraft_-_July_2012-19_07_2012","postedDate":1342656000,"content":"Are you interested in joining other eSports enthusiasts to watch a live stream of intense professional StarCraft II action? Check out the following list to see if there's an event being organized in your area!","sourceType":"Blizzard"},{"title":"GSL: Four Players, Four Teams","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5487901\/GSL_Four_Players_Four_Teams-19_07_2012","postedDate":1342656000,"content":"Both the GOMTV StarCraft League and Team League are down to their last four competitors. In the individual league, terran hero ByunPrime takes on LG_IMSeed while GSL Champions SK.MC and MvPDongRaeGu fight it out for a shot at another trophy. This weekend, SlayerS-EG goes up against Team SCV Life and MVP faces FXOpen in the GSTL. If you haven’t watched yet this season, there’s no better time to jump in and cheer for your favorite.","sourceType":"Blizzard"},{"title":"Blizzard Games at gamescom","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5448430\/Blizzard_Games_at_gamescom-17_07_2012","postedDate":1342483200,"content":"You’ll find our costume and dance contests, eSports action, live raids, and all-around excitement at the Blizzard Entertainment booth at gamescom 2012. But perhaps best of all, you’ll be able to try out our newest games for yourselves!","sourceType":"Blizzard"},{"title":"Blaze of Glory: Brood War’s Final Four (Week Two)","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=3blog\/5449280\/Blaze_of_Glory_Brood_War%E2%80%99s_Final_Four_Week_Two-17_07_2012","postedDate":1342483200,"content":"Last week’s match between JangBi and ZerO was positively breathtaking. It was everything you could want from a PvZ, and left both the viewers and the commentators speechless with emotion. The next match has the potential to be even better. Flash takes on Fantasy in a match to determine which terran legend will advance to face JangBi for the gold. Will Flash reach the last Starleague finals, poised to break NaDa’s record and become the winningest player in history? Or will Fantasy deny him that honor, earn a rematch with JangBi, and tie his mentors BoxeR and iloveoov for OSL golds?","sourceType":"Blizzard"},{"title":"Battle.net World Championship Headed to China","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5458046\/Battlenet_World_Championship_Headed_to_China_-15_07_2012","postedDate":1342310400,"content":"We’ve just announced that the Battle.net World Championship event -- the culmination of the over 30 StarCraft II World Championship Series (WCS) tournaments, and home to the upcoming World of Warcraft Arena global finals -- will take place November 17 and 18 in Shanghai, China.","sourceType":"Blizzard"},{"title":"WCS - Canada Nationals Now Live","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5435610\/WCS_-_Canada_Nationals_Now_Live-14_07_2012","postedDate":1342224000,"content":"The WCS Canada Nationals are here, hosted by the North American Star League. Thirty-two of Canada’s best have qualified to compete, and this weekend we’ll see who among them will earn the right to represent their country at the North American Finals. With some of North America’s best pro-gamers clashing with the strongest up and coming amateurs, you’ll want to be sure to catch the action and cheer on your favorites.","sourceType":"Blizzard"},{"title":"WCS - South America Finals Now Live","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5379425\/WCS_-_South_America_Finals_Now_Live-14_07_2012","postedDate":1342224000,"content":"The StarCraft II World Championship Series: South America Finals are starting! This event represents the culmination of the National Qualifiers and National Championships events from throughout South America, hosted by both Blizzard Entertainment and official tournament organizers.","sourceType":"Blizzard"},{"title":"WCS Canada Player Spotlight: Ostojiy, Drewbie, and HuK","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5435614\/WCS_Canada_Player_Spotlight_Ostojiy_Drewbie_and_HuK-13_07_2012","postedDate":1342137600,"content":"This weekend, thirty-two of Canada’s best will come together just outside of Toronto to compete for the right to be called the national champion, and to represent Canada at the North American finals. The games are sure to be exciting and full of stories, but those stories are all the richer if you know the faces behind the keyboards. We contacted three players from the tournament and asked them for their thoughts.","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5448424\/eSports_Upcoming_Tournaments-13_07_2012","postedDate":1342137600,"content":"Take a look at some of the open tournaments coming up in the next days - you can sign up to take part, or simply watch the live streams to get inspired by the players. It’s your turn now!","sourceType":"Blizzard"},{"title":"NASL Season 3 Grand Finals Preview","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5435613\/NASL_Season_3_Grand_Finals_Preview-13_07_2012","postedDate":1342137600,"content":"The North American Star League has grown by leaps and bounds since it started last year, and this third season has been the best yet. After nine long weeks of matches and a nailbiting playoffs, only eight players remain to fight it out for the grand prize. Will EG.PuMa repeat? Will Liquid`HerO or SK.MC take their revenge? Or will a new champion arise?","sourceType":"Blizzard"},{"title":"Meet the WCS South America Finals Players","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5436098\/Meet_the_WCS_South_America_Finals_Players-13_07_2012","postedDate":1342137600,"content":"The World Championship Series: South America Finals will be held this weekend on July 14 and 15 July in Sao Paulo, Brazil. Today we present the best StarCraft II players in South America. They have been crowned National Champions in their respective countries, and they will now face off for the continental champion title.","sourceType":"Blizzard"},{"title":"WCS - China Nationals Now Live!","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5435608\/WCS_-_China_Nationals_Now_Live-13_07_2012","postedDate":1342137600,"content":"The best of China have been battling it out to determine which sixteen will advance to the WCS China Nationals this weekend. The top thirty-two have already been determined, and by this weekend only half will remain. Those sixteen will have their games cast by legendary caster Dan “Artosis” Stemkoski, and Rob Simpson of Blizzard’s eSports team.","sourceType":"Blizzard"},{"title":"Three WCS Events Live This Weekend","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5436097\/Three_WCS_Events_Live_This_Weekend-13_07_2012","postedDate":1342137600,"content":"So, we hope you’re all in the mood for some eSports… because this weekend, we’ve got three major WCS events! The WCS South America Finals, WCS Canada Nationals, and WCS China Nationals are all going on this weekend. You’re going to need all your browser tabs if you want to catch all the action.","sourceType":"Blizzard"},{"title":"Costume and Dance Contests at gamescom 2012","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4\/d3\/en\/blog\/5436094\/Costume_and_Dance_Contests_at_gamescom_2012-12_07_2012","postedDate":1342051200,"content":"Ready to exhibit your talent at gamescom 2012? Become your favorite character and flaunt your creativity in the Blizzard Costume Contest on Saturday, August 18. Choose a World of Warcraft race and put on your dancing shoes for the Blizzard Dance Contest on Sunday, August 19.","sourceType":"Blizzard"},{"title":"WCS - Chile Nationals Recap","url":"http:\/\/eu.battle.net\/sc2\/en\/?page=4blog\/5435609\/WCS_-_Chile_Nationals_Recap-12_07_2012","postedDate":1342051200,"content":"Last month,&#160;SC2LA.com&#160;concluded their eight-phase online qualifier tournaments. After many epic battles with hundreds of players, eight slots were earned by the best players that participated in the World Championship Series: Chile Nationals.","sourceType":"Blizzard"}]