[{"title":"WCS - México Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6823325\/WCS_-_M%C3%A9xico_Nationals-7_31_2012","postedDate":1343692800,"content":"The top StarCraft II players in Mexico will face off in the StarCraft II World Championship Series (WCS) Mexico Nationals. Players battled through on-site qualifier tournaments in different states of Mexico to earn the right to fight at the Nationals. The best of the best will be competing for honor and glory, and the top six will represent their country at the North America Finals, which will be held on August 24-26 in Raleigh, North Carolina!","sourceType":"Blizzard"},{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6823327\/Your_Guide_to_Patch_150_Arcade-7_31_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for.&#160;","sourceType":"Blizzard"},{"title":"Patch 1.5.0 Now Live","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830760\/Patch_150_Now_Live-7_31_2012","postedDate":1343692800,"content":"StarCraft II: Wings of Liberty patch 1.5.0 is now live! This patch features significant user interface changes to Battle.net, including the addition of the entirely new Arcade game menu, A new streaming launcher, QuickNav, graphical improvements, new Editor modules, and a number of bug fixes.\r\n  \r\n  Be sure to check out the full patch notes to learn all about the latest changes.","sourceType":"Blizzard"},{"title":"WCS - Nordic Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6744628\/WCS_-_Nordic_Nationals-7_28_2012","postedDate":1343433600,"content":"After the upcoming Russian Federation and Ukraine Nationals, the next national event in the StarCraft II World Championship Series takes place in Stockholm, Sweden on July 28. The line-up will include the top Swedish, Danish, Norwegian, and Finnish StarCraft II players, who’ll be battling their countrymen for a share of the $30,000 USD prize pool and some coveted slots in the Europe Finals in September.","sourceType":"Blizzard"},{"title":"TSL4 Begins","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830763\/TSL4_Begins-7_27_2012","postedDate":1343347200,"content":"It’s finally here. The qualifiers have run, the bracket has been revealed, and now the Team Liquid Starleague 4 Round of 32 kicks off this weekend. With an all-star lineup full of international champions and up-and-comers, and broadcast by some of the best casters in the business, the TSL4 is most definitely going to be an event to keep your eyes on.","sourceType":"Blizzard"},{"title":"StarCraft II: Wings of Liberty Turns Two!","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830761\/StarCraft_II_Wings_of_Liberty_Turns_Two-7_27_2012","postedDate":1343347200,"content":"Happy Birthday StarCraft II! Please join us in celebrating StarCraft II’s second anniversary. What are your favorite StarCraft II memories from the last year? Feel free to share your favorite moments in the comments!","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830764\/WCS_Singapore_Nationals_this_Weekend-7_27_2012","postedDate":1343347200,"content":"On July 28-29 Singapore's top players will face off in the StarCraft II World Championship Series (WCS) Singapore Nationals. 64 players will battle it out through the on-site qualifier tournaments on Day 1, then the remaining16 players will battle for the honor of representing Singapore at the Asia Finals on Day 2. With a $10,000 prize pool, this is the biggest StarCraft II event Singapore has ever seen!","sourceType":"Blizzard"},{"title":"WCS Nordic Player Spotlight: EG.ThorZaIN and MorroW","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6821784\/WCS_Nordic_Player_Spotlight_EGThorZaIN_and_MorroW-7_27_2012","postedDate":1343347200,"content":"The Nordic Nationals this weekend are looking to be one of the most exciting events of the year. The level of talent is absolutely staggering, with several world-class players fighting for a limited number of spots at the Europe Finals. We got a chance to chat with two such players, Marcus “EG.ThorZaIN” Elköf and Stefan “MorroW” Anderson, and find out their thoughts going into the event.","sourceType":"Blizzard"},{"title":"What You Need To Know About Patching 1.5.0","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6821783\/What_You_Need_To_Know_About_Patching_150-7_26_2012","postedDate":1343260800,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster.\r\n  \r\n  We wanted to provide a little guidance so everyone is prepared and able to get into the game fast on patch day!","sourceType":"Blizzard"},{"title":"Election Day for the Protoss President: GSL Finals Preview","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6821787\/Election_Day_for_the_Protoss_President_GSL_Finals_Preview-7_26_2012","postedDate":1343260800,"content":"This weekend, both the Global StarCraft II League (GSL) and the Global StarCraft II Team League (GSTL) will conclude in an epic ocean-side clash at Haeundae Beach in Busan, South Korea.&#160; First, Jang “SK.MC” Min Chul will seek his third GSL title, but the brilliant upstart and comeback king LG-IM.Seed looks to establish himself as the protoss counterpart to his teammates NesTea and Mvp. The action begins this Friday at 3:10 AM PDT!","sourceType":"Blizzard"},{"title":"GameSpot eSports Wrap Up: Interviews and More","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6805714\/GameSpot_eSports_Wrap_Up_Interviews_and_More-7_25_2012","postedDate":1343174400,"content":"Our friends over at GameSpot have been ramping up their coverage of eSports this year. They’ve done some great interviews at all the major eSports events, which we’ve collected for you here! How does Scarlett feel about her win at WCS Canada? Why did MLG decide to abandon their Pay Per View model? And what’s going on with the documentary about Tasteless and Artosis? Find out answers to all these questions and more.","sourceType":"Blizzard"}]