[{"title":"WCS - México Nationals Live Aug 3-4","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6823325\/WCS_-_M%C3%A9xico_Nationals_Live_Aug_3-4-8_3_2012","postedDate":1343952000,"content":"The top StarCraft II players in Mexico faced off in the StarCraft II World Championship Series (WCS) Mexico Nationals. Players battled through on-site qualifier tournaments in different states of Mexico to earn the right to fight at the Nationals. The best of the best from this event will go on to represent their country at the North America Finals, which will be held on August 24-26 in Raleigh, North Carolina!","sourceType":"Blizzard"},{"title":"WCS – Four New Champions Crowned in the Nordic Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6871749\/WCS_%E2%80%93_Four_New_Champions_Crowned_in_the_Nordic_Nationals-8_3_2012","postedDate":1343952000,"content":"The top Norwegian, Danish, Finnish, and Swedish StarCraft II players gathered in Stockholm, Sweden on July 28 for the WCS Nordic Nationals. Each of the 28 competitors battled their countrymen for a share of the $30,000 USD prize pool and one of six slots in the Europe Finals.","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments -- August 3","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6871750\/eSports_Upcoming_Tournaments_--_August_3-8_3_2012","postedDate":1343952000,"content":"Various competition organizers hold regular online tournaments in which you can compete against other players and maybe even win some prizes! Most of these contests are open to everyone. In addition, there are professional tournaments taking place like the&#160;WCS Mexico Nationals, the&#160;WCS Korea Nationals&#160;or the&#160;ASUS ROG Assembly Summer 2012&#160;which you can follow via video stream. Interested?","sourceType":"Blizzard"},{"title":"WCS South Korea Nationals Coming","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6871745\/WCS_South_Korea_Nationals_Coming-8_2_2012","postedDate":1343865600,"content":"One of the most anticipated&#160;StarCraft II World Championship Series (WCS)&#160;events is almost here! The South Korea Nationals will be held from August 6–24, and a total of 32 players will vie for one of 10 slots available to represent South Korea in the WCS Asia Finals.&#160;","sourceType":"Blizzard"},{"title":"Assembly Summer 2012","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6871744\/Assembly_Summer_2012-8_1_2012","postedDate":1343779200,"content":"This weekend, 32 players will clash in Finland at the 4th ASUS ROG StarCraft II tournament: Assembly Summer 2012. Featuring an all-star production crew and a mix of players that includes the international debut of World Championship Series USA representative Conan&#160;\"EGSuppy\"&#160;Liu and UK representative Paul&#160;\"d.JonnyREcco\"&#160;Whyte, Assembly Summer 2012 should be exactly what you need to scratch the eSports itch.","sourceType":"Blizzard"},{"title":"The Crowning Event: OGN Starleague&#39;s Brood War Finals","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6855427\/The_Crowning_Event_OGN_Starleagues_Brood_War_Finals_-8_1_2012","postedDate":1343779200,"content":"Thirteen years of history. Thirteen years of stories. Thirteen years of Brood War. It’s all led up to this single match. Heo “JangBi” Yeong Moo and Jung “Fantasy” Myung Hoon will face each other in the first and only repeat finals in Starleague history, for the honor of being the last Brood War Starleague champion. Fittingly, this finale will kick off with a revival of the original eSports rivalry: a Legends Match between Lim “BoxeR” Yo Hwan and Hong “YellOw” Jin Ho.","sourceType":"Blizzard"},{"title":"The Blizzard Comic Contest Is Back!","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6855421\/The_Blizzard_Comic_Contest_Is_Back-8_1_2012","postedDate":1343779200,"content":"The time has come for the epic return of the Blizzard Comic Contest! We’re looking for original comics focused on the Warcraft, Diablo, or StarCraft universes... and we want you to create them.","sourceType":"Blizzard"},{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6823327\/Your_Guide_to_Patch_150_Arcade-7_31_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for.&#160;","sourceType":"Blizzard"},{"title":"Patch 1.5.0 Now Live","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830760\/Patch_150_Now_Live-7_31_2012","postedDate":1343692800,"content":"StarCraft II: Wings of Liberty patch 1.5.0 is now live! This patch features significant user interface changes to Battle.net, including the addition of the entirely new Arcade game menu, A new streaming launcher, QuickNav, graphical improvements, new Editor modules, and a number of bug fixes.\r\n  \r\n  Be sure to check out the full patch notes to learn all about the latest changes.","sourceType":"Blizzard"},{"title":"WCS - Nordic Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6744628\/WCS_-_Nordic_Nationals-7_28_2012","postedDate":1343433600,"content":"After the upcoming Russian Federation and Ukraine Nationals, the next national event in the StarCraft II World Championship Series takes place in Stockholm, Sweden on July 28. The line-up will include the top Swedish, Danish, Norwegian, and Finnish StarCraft II players, who’ll be battling their countrymen for a share of the $30,000 USD prize pool and some coveted slots in the Europe Finals in September.","sourceType":"Blizzard"},{"title":"TSL4 Begins","url":"http:\/\/us.battle.net\/sc2\/en\/blog\/6830763\/TSL4_Begins-7_27_2012","postedDate":1343347200,"content":"It’s finally here. The qualifiers have run, the bracket has been revealed, and now the Team Liquid Starleague 4 Round of 32 kicks off this weekend. With an all-star lineup full of international champions and up-and-comers, and broadcast by some of the best casters in the business, the TSL4 is most definitely going to be an event to keep your eyes on.","sourceType":"Blizzard"},{"title":"StarCraft II: Wings of Liberty Turns Two!","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6830761\/StarCraft_II_Wings_of_Liberty_Turns_Two-7_27_2012","postedDate":1343347200,"content":"Happy Birthday StarCraft II! Please join us in celebrating StarCraft II’s second anniversary. What are your favorite StarCraft II memories from the last year? Feel free to share your favorite moments in the comments!","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6830764\/WCS_Singapore_Nationals_this_Weekend-7_27_2012","postedDate":1343347200,"content":"On July 28-29 Singapore's top players will face off in the StarCraft II World Championship Series (WCS) Singapore Nationals. 64 players will battle it out through the on-site qualifier tournaments on Day 1, then the remaining16 players will battle for the honor of representing Singapore at the Asia Finals on Day 2. With a $10,000 prize pool, this is the biggest StarCraft II event Singapore has ever seen!","sourceType":"Blizzard"},{"title":"WCS Nordic Player Spotlight: EG.ThorZaIN and MorroW","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6821784\/WCS_Nordic_Player_Spotlight_EGThorZaIN_and_MorroW-7_27_2012","postedDate":1343347200,"content":"The Nordic Nationals this weekend are looking to be one of the most exciting events of the year. The level of talent is absolutely staggering, with several world-class players fighting for a limited number of spots at the Europe Finals. We got a chance to chat with two such players, Marcus “EG.ThorZaIN” Elköf and Stefan “MorroW” Anderson, and find out their thoughts going into the event.","sourceType":"Blizzard"},{"title":"What You Need To Know About Patching 1.5.0","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6821783\/What_You_Need_To_Know_About_Patching_150-7_26_2012","postedDate":1343260800,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster.\r\n  \r\n  We wanted to provide a little guidance so everyone is prepared and able to get into the game fast on patch day!","sourceType":"Blizzard"},{"title":"Election Day for the Protoss President: GSL Finals Preview","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6821787\/Election_Day_for_the_Protoss_President_GSL_Finals_Preview-7_26_2012","postedDate":1343260800,"content":"This weekend, both the Global StarCraft II League (GSL) and the Global StarCraft II Team League (GSTL) will conclude in an epic ocean-side clash at Haeundae Beach in Busan, South Korea.&#160; First, Jang “SK.MC” Min Chul will seek his third GSL title, but the brilliant upstart and comeback king LG-IM.Seed looks to establish himself as the protoss counterpart to his teammates NesTea and Mvp. The action begins this Friday at 3:10 AM PDT!","sourceType":"Blizzard"},{"title":"GameSpot eSports Wrap Up: Interviews and More","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6805714\/GameSpot_eSports_Wrap_Up_Interviews_and_More-7_25_2012","postedDate":1343174400,"content":"Our friends over at GameSpot have been ramping up their coverage of eSports this year. They’ve done some great interviews at all the major eSports events, which we’ve collected for you here! How does Scarlett feel about her win at WCS Canada? Why did MLG decide to abandon their Pay Per View model? And what’s going on with the documentary about Tasteless and Artosis? Find out answers to all these questions and more.","sourceType":"Blizzard"},{"title":"WCS - Victory in Kiev","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6813347\/WCS_-_Victory_in_Kiev-7_25_2012","postedDate":1343174400,"content":"Russia’s top sixteen StarCraft II players, along with Ukraine’s top eight, gathered in Kiev, Ukraine on July 21 and 22 for the StarCraft II World Championship Series (WCS) Russian Federation and Ukraine Nationals. The epic and intense battles decided which players would be worthy of representing their countries in the WCS Europe Finals in September. The event took place in Kiev’s biggest games center, the Kiev CyberSport Arena.","sourceType":"Blizzard"},{"title":"Last Chance: 1.5.0 Beta Coming To A Close","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6805717\/Last_Chance_150_Beta_Coming_To_A_Close-7_25_2012","postedDate":1343174400,"content":"Your chance to help test the Patch 1.5.0 Arcade Beta is coming to a close! Your feedback on the 1.5.0 experience, including the Arcade and multiplayer, will help ensure that everything runs as smoothly as possible with the official release of Patch 1.5.0. If you’re not already familiar with it, The Patch 1.5.0 Beta introduces a slew of exciting new features, including the Arcade, improved UI, a new streaming client to reduce patching times, powerful new Editor tools and more.","sourceType":"Blizzard"},{"title":"Mists of Pandaria Launches September 25, 2012 – Pre-Sales NOW OPEN","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2\/wow\/en\/blog\/6771526\/Mists_of_Pandaria_Launches_September_25_2012_%E2%80%93_Pre-Sales_NOW_OPEN-7_25_2012","postedDate":1343174400,"content":"Heroes of Azeroth, prepare to embark for an exotic new frontier! World of Warcraft®: Mists of Pandaria™ is launching on September 25, 2012 and you can be ready to play when the servers go live by pre-purchasing the game digitally. Plus, for the first time ever, players will have the option to upgrade a pre-purchase to the all-new Digital Deluxe Edition which comes with all of the in-game items from the retail Collector’s Edition, including a World of Warcraft pet and mount, banner sigil and accent for Diablo® III, and Battle.net® portraits for StarCraft® II.","sourceType":"Blizzard"},{"title":"WCS - South America Champion Named","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6805715\/WCS_-_South_America_Champion_Named-7_24_2012","postedDate":1343088000,"content":"Excitement was in the air as the first eSports fans lined up the morning of the South America Finals. Conversations about the imminent WCS event buzzed as fans from all parts of South America met their Battle.net friends for the first time in real life. Finally, the doors opened and the auditorium where the battles would take place began to fill. The players were already on stage and the World Championship Series: South America Finals were under way!","sourceType":"Blizzard"},{"title":"WCS - China Nationals Recap","url":"http:\/\/us.battle.net\/sc2\/en\/?page=2blog\/6773181\/WCS_-_China_Nationals_Recap-7_23_2012","postedDate":1343001600,"content":"The StarCraft II World Championship Series (WCS) China Nationals brought together the top sixteen Chinese StarCraft II players for the 2012 CCG EXPO in Shanghai, Friday, July 13-15. The top ten earned spots to represent China at the WCS Asia Finals and compete with players from Korea, Taiwan, and Singapore.\r\n  \r\n  Find out what went down!","sourceType":"Blizzard"},{"title":"IPL Update: Last Teams Standing","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6773180\/IPL_Update_Last_Teams_Standing-7_23_2012","postedDate":1343001600,"content":"It all comes down to this. We started the Team Arena Challenge with 24 of StarCraft II’s best teams from around the world. Now, only seven are left standing: SlayerS, Incredible Miracle, Liquid, MVP, StarTale, Evil Geniuses, and Prime. By the end of this week, only two will remain. Who will seize their berth to the live Grand Finals in San Francisco","sourceType":"Blizzard"},{"title":"WCS - Russian Federation and Ukraine Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6744630\/WCS_-_Russian_Federation_and_Ukraine_Nationals_-7_21_2012","postedDate":1342828800,"content":"The next national event in the&#160;StarCraft II World Championship Series&#160;takes place July 21 and 22 at the CyberSport Arena in Kiev, Ukraine. The line-up will include the top eight Ukrainian and top 16 Russian StarCraft II players. They’ll be fighting it out not only for fantastic prize pools of $5,000 USD and $15,000 USD respectively, but also for two Ukrainian and three Russian slots in the Europe Finals.","sourceType":"Blizzard"},{"title":"MLG Summer Arena July 20-22!","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6744637\/MLG_Summer_Arena_July_20-22-7_20_2012","postedDate":1342742400,"content":"The MLG summer season is kicking off with the Summer Arena this weekend. The Arenas have always provided the highest density of top-quality games, full of Korean stars and Western heroes. In past seasons they have been Pay per View, but thanks to a partnership with Full Sail University, MLG is now&#160;offering the stream for free!","sourceType":"Blizzard"},{"title":"WCS - Korea Offline Preliminaries July 22-23","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6761566\/WCS_-_Korea_Offline_Preliminaries_July_22-23-7_20_2012","postedDate":1342742400,"content":"One of the most anticipated World Championship Series (WCS) events, the Korea National Finals, are quickly approaching. The offline preliminaries for the event will be held on July 22 and 23, and will be broadcast by GOMTV. This event is going to be special, though: eSports superstars from all leagues, including KeSPA’s ProLeague, Ongamenet’s StarLeague, and GomTV’s GSL and GSTL will take part in the WCS for the first time to determine who will represent Korea at the Battle.net World Championship in Shanghai later this year. Who knows what matchups we could see? Flash vs Mvp? Jaedong vs DongRaeGu? &#160;You won’t want to miss this one!","sourceType":"Blizzard"},{"title":"eSports: Upcoming Tournaments July 20","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6761564\/eSports_Upcoming_Tournaments_July_20-7_20_2012","postedDate":1342742400,"content":"Various competition organizers hold regular online tournaments in which you can compete against other players and maybe even win some prizes! Most of these contests are open to everyone. In addition, there are professional tournaments taking place like the World Championship Series Russian Federation &#38; Ukraine Nationals and the 2012 MLG Summer Arena which you can follow via video stream. Interested? Take a look at some of the open tournaments coming up in the next days - you can sign up to take part, or simply watch the live streams to get inspired by the players.","sourceType":"Blizzard"},{"title":"BarCraft: Updated July 19","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/4798486\/BarCraft_Updated_July_19-7_19_2012","postedDate":1342656000,"content":"Are you interested in joining other eSports enthusiasts to watch a live stream of professional StarCraft II action? Check out the following list to see if there's an event being organized in your area.","sourceType":"Blizzard"},{"title":"GSL: Four Players, Four Teams","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6744636\/GSL_Four_Players_Four_Teams-7_18_2012","postedDate":1342569600,"content":"Both the GOMTV StarCraft League and Team League are down to their last four competitors. In the individual league, terran hero ByunPrime takes on LG_IMSeed while GSL Champions SK.MC and MvPDongRaeGu fight it out for a shot at another trophy. This weekend, SlayerS-EG goes up against Team SCV Life and MVP faces FXOpen in the GSTL. If you haven’t watched yet this season, there’s no better time to jump in and cheer for your favorite.","sourceType":"Blizzard"},{"title":"ESV.TV Grand Prix: Watch New Stars Rise","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6744631\/ESVTV_Grand_Prix_Watch_New_Stars_Rise-7_18_2012","postedDate":1342569600,"content":"The ESV TV Korean Weekly circuit has been the place where stars rise to power before they take the GSL by storm. Each week some of the best players in the world fight it out for a chance at a prize pool and a spot in the finals. After eight grueling weeks 32 players have earned the right to compete in the ESV TV Grand Prix #2 finals!","sourceType":"Blizzard"},{"title":"ACL to Host WCS Australia National\/Oceania Finals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6744629\/ACL_to_Host_WCS_Australia_NationalOceania_Finals-7_17_2012","postedDate":1342483200,"content":"We’re pleased to announce our partnership with the Australian Cyber League to host the WCS Australia National and Oceania Finals the weekend of August 11th and 12th at the&#160;Australian Technology Park in Sydney.","sourceType":"Blizzard"},{"title":"Blaze of Glory: Brood War’s Final Four (Week Two)","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6711274\/Blaze_of_Glory_Brood_War%E2%80%99s_Final_Four_Week_Two-7_16_2012","postedDate":1342396800,"content":"Last week’s match between JangBi and ZerO was positively breathtaking. It was everything you could want from a PvZ, and left both the viewers and the commentators speechless with emotion. The next matchup has the potential to be even better as Flash takes on Fantasy to determine which terran legend will advance to face JangBi for the gold. Will Flash reach the last Starleague finals, poised to break NaDa’s record and become the winningest player in history? Or will Fantasy deny him that honor, earn a rematch with JangBi, and tie his mentors BoxeR and iloveoov for OSL golds?","sourceType":"Blizzard"},{"title":"Battle.net World Championship Headed to China","url":"http:\/\/us.battle.net\/sc2\/en\/?page=3blog\/6697324\/Battlenet_World_Championship_Headed_to_China-7_15_2012","postedDate":1342310400,"content":"We’ve just announced that the&#160;Battle.net World Championship event&#160;-- the culmination of the over 30 StarCraft II World Championship Series (WCS) tournaments, and home to the upcoming World of Warcraft Arena global finals -- will take place November 17 and 18 in Shanghai, China.","sourceType":"Blizzard"},{"title":"WCS - Canada Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6688640\/WCS_-_Canada_Nationals-7_14_2012","postedDate":1342224000,"content":"The WCS Canada Nationals, hosted by the North American Star League happened July 14-15. Thirty-two of Canada’s best qualified to compete, and battled it out to see who among them would represent their country at the North American Finals.","sourceType":"Blizzard"},{"title":"WCS - South America Finals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/5393887\/WCS_-_South_America_Finals-7_14_2012","postedDate":1342224000,"content":"The StarCraft II World Championship Series: South America Finals occurred July 14-15! This event represented the culmination of the National Qualifiers and National Championships events from throughout South America, hosted by both Blizzard Entertainment and official tournament organizers.","sourceType":"Blizzard"},{"title":"WCS - China Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6688639\/WCS_-_China_Nationals-7_13_2012","postedDate":1342137600,"content":"The best of China have been battling it out to determine which sixteen will advance to the WCS China Nationals this weekend. The top thirty-two have already been determined, and grueling competition has whittled that number down to 10. Those games were cast by legendary caster Dan “Artosis” Stemkoski, and Rob Simpson of Blizzard’s eSports team. Featuring international star players with long histories, like XiGua, F91, MacSed, and Loner, the level of play was high and the games were excellent. Expect a recap detailing the explosive action soon!","sourceType":"Blizzard"},{"title":"Upcoming Tournaments -- July 13","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6697326\/Upcoming_Tournaments_--_July_13-7_13_2012","postedDate":1342137600,"content":"In addition to open tournaments and regional qualifiers, here are some bigger tournaments taking place in the next couple days like the&#160;World Championship Series South America Finals,&#160;World Championship Series: China Nationals, and&#160;World Championship Series: Canada Nationals&#160;which you can follow via stream.","sourceType":"Blizzard"},{"title":"NASL Season 3 Grand Finals Preview","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6711265\/NASL_Season_3_Grand_Finals_Preview-7_13_2012","postedDate":1342137600,"content":"The North American Star League has grown by leaps and bounds since it started last year, and this third season has been the best yet. After nine long weeks of matches and a nailbiting playoffs, only eight players remain to fight it out for the grand prize. Will EG.PuMa repeat? Will Liquid`HerO or SK.MC take their revenge? Or will a new champion arise?","sourceType":"Blizzard"},{"title":"WCS Canada Player Spotlight: Ostojiy, Drewbie, and HuK","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6696689\/WCS_Canada_Player_Spotlight_Ostojiy_Drewbie_and_HuK-7_13_2012","postedDate":1342137600,"content":"This weekend, thirty-two of Canada’s best will come together just outside of Toronto to compete for the right to be called the national champion, and to represent Canada at the North American finals. The games are sure to be exciting and full of stories, but those stories are all the richer if you know the faces behind the keyboards. We contacted three players from the tournament and asked them for their thoughts.","sourceType":"Blizzard"},{"title":"Meet the WCS South America Finals Players","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6696686\/Meet_the_WCS_South_America_Finals_Players-7_12_2012","postedDate":1342051200,"content":"The World Championship Series: South America Finals will be held this weekend on July 14 and 15 July in Sao Paulo, Brazil.","sourceType":"Blizzard"},{"title":"WCS – Stephano Takes the French Nationals","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6697317\/WCS_%E2%80%93_Stephano_Takes_the_French_Nationals-7_12_2012","postedDate":1342051200,"content":"The StarCraft II World Championship Series (WCS) France Nationals brought together the top 16 French StarCraft II players at the annual Japan Expo in Paris, from July 5 to 8. The three frontrunners in the exciting tournament earned well-deserved spots to represent France at the WCS Europe Finals in September.","sourceType":"Blizzard"},{"title":"World Championship Series Events &amp; Overview","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/4871770\/World_Championship_Series_Events__Overview-7_11_2012","postedDate":1341964800,"content":"The StarCraft II World Championship Series is underway! Leading up to the 2012 Battle.net World Championship, to be held later this year, this inaugural series consists of over 30 eSports events to be held around the globe, hosted by both Blizzard Entertainment and official tournament organizers.","sourceType":"Blizzard"},{"title":"WCS - Chile Nationals Recap","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6688648\/WCS_-_Chile_Nationals_Recap-7_11_2012","postedDate":1341964800,"content":"Last month, SC2LA.com concluded their eight-phase online qualifier tournaments. After many epic battles with hundreds of players, eight slots were earned by the best players that participated in the World Championship Series: Chile Nationals.","sourceType":"Blizzard"},{"title":"Blizzard Entertainment Storms San Diego For Comic-Con 2012","url":"http:\/\/us.battle.net\/sc2\/en\/?page=4blog\/6693941\/Blizzard_Entertainment_Storms_San_Diego_For_Comic-Con_2012-7_11_2012","postedDate":1341964800,"content":"Going to Comic-Con this week? Here is the full line-up of where you can find our licensed products!","sourceType":"Blizzard"}]