[{"title":"WCS South Korea Nationals Coming","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/431443\/WCS_South_Korea_Nationals_Coming-8_3_2012","postedDate":1343952000,"content":"One of the most anticipated StarCraft II World Championship Series (WCS) events is almost here! The South Korea Nationals will be held from August 6–24, and a total of 32 players will vie for one of 10 slots available to represent South Korea in the WCS Asia Finals.","sourceType":"Blizzard"},{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428179\/Your_Guide_to_Patch_150_Arcade-7_31_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for. &#160;","sourceType":"Blizzard"},{"title":"Patch 1.5.0 Now Live","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428181\/Patch_150_Now_Live-7_31_2012","postedDate":1343692800,"content":"&#160;","sourceType":"Blizzard"},{"title":"What You Need To Know About Patching 1.5.0","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428178\/What_You_Need_To_Know_About_Patching_150-7_30_2012","postedDate":1343606400,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster. We wanted to provide a little guidance so everyone is prepared and able to get into the game fast on patch day!","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/426745\/WCS_Singapore_Nationals_this_Weekend-7_27_2012","postedDate":1343347200,"content":"From July 28 to 29th, the top Singapore players will face off in the StarCraft II World Championship Series for the Singapore Nationals. Players will battle it out through the on-site qualifier tournaments on Day 1; and the top 16 players will fight for the top spot to qualify for the Asia to represent Singapore on Day 2. With a $10,000 prize pool, this is the biggest event Singapore has for StarCraft II!&#160;","sourceType":"Blizzard"},{"title":"WCS Singapore Finals Confirmed July 28-29","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/424974\/WCS_Singapore_Finals_Confirmed_July_28-29-7_25_2012","postedDate":1343174400,"content":"Blizzard Entertainment and the ESL will bring the best players in Southeast Asia together to compete at the StarCraft II World Championship Series (WCS) Singapore Nationals and the Southeast Asia Open. The combined event is set to take place in Singapore, July 28-29 at the Funan Main Atrium located inside Funan Digitalife Mall, City Hall.","sourceType":"Blizzard"},{"title":"GSL: Four Players, Four Teams","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421774\/GSL_Four_Players_Four_Teams-7_19_2012","postedDate":1342656000,"content":"Both the GOMTV StarCraft League and Team League are down to their last four competitors. In the individual league, terran hero ByunPrime takes on LG_IMSeed while GSL Champions SK.MC and MvPDongRaeGu fight it out for a shot at another trophy. This weekend, SlayerS-EG goes up against Team SCV Life and MVP faces FXOpen in the GSTL. If you haven’t watched yet this season, there’s no better time to jump in and cheer for your favorite.","sourceType":"Blizzard"},{"title":"ACL to Host WCS Australia National\/Oceania Finals","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421773\/ACL_to_Host_WCS_Australia_NationalOceania_Finals-7_18_2012","postedDate":1342569600,"content":"We’re pleased to announce our partnership with the Australian Cyber League to host the WCS Australia National and Oceania Finals the weekend of August 11th and 12th at the&#160;Australian Technology Park in Sydney.","sourceType":"Blizzard"},{"title":"Battle.net World Championship Headed to China","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421225\/Battlenet_World_Championship_Headed_to_China-7_16_2012","postedDate":1342396800,"content":"We’ve just announced that the Battle.net World Championship event -- the culmination of the over 30 StarCraft II World Championship Series (WCS) tournaments, and home to the upcoming World of Warcraft Arena global finals -- will take place November 17 and 18 in Shanghai, China.","sourceType":"Blizzard"},{"title":"SEA\/ANZ StarCraft II Tournaments on the Horizon: Updated","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/216986\/SEAANZ_StarCraft_II_Tournaments_on_the_Horizon_Updated-7_10_2012","postedDate":1341878400,"content":"Think you have what it takes to compete in a local StarCraft II tournament? Various competition organizers hold regular tournaments where you can take on the toughest local competition for a chance at winning prizes. If you’re more of the spectator type, you can always join the audience and cheer on some of the best players in the region as they compete for glory. You might even learn a trick or two!","sourceType":"Blizzard"},{"title":"IPL Update: Team Leagues, Qualifers and Hot Imports","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/416560\/IPL_Update_Team_Leagues_Qualifers_and_Hot_Imports-7_10_2012","postedDate":1341878400,"content":"There’s always something going on in the IGN Proleague. Last weekend, in addition to the usual team league and Fight Club content, IPL put on a showmatch series at Hot Import Nights in San Francisco between four of the world’s best players. Now, the Team Arena Challenge is finally winding down: only the best of the best remain. Six teams will go home over the next two weeks, so be sure to cheer on your favorite.","sourceType":"Blizzard"},{"title":"New StarCraft Fan Art","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/416561\/New_StarCraft_Fan_Art-7_10_2012","postedDate":1341878400,"content":"The Blizzard Fan Art Section has been updated with two new pieces of fan artwork set within the StarCraft universe","sourceType":"Blizzard"},{"title":"Blaze of Glory: Brood War&#39;s Final Four (Week One)","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/416559\/Blaze_of_Glory_Brood_Wars_Final_Four_Week_One-7_10_2012","postedDate":1341878400,"content":"With the death of the MSL, the hybrid Proleague so focused on StarCraft II, and the preliminaries already complete for the first StarCraft II OSL, you might make the mistake of pronouncing Brood War “dead,” but it’s not over yet. There’s still a Starleague to be played. JangBi, ZerO, Fantasy, and Flash have one last chance to make eSports history as the final Brood War champion. And whether you’re a fan of Brood War or not, any fan of eSports should bear witness to the conclusion of this legendary era.","sourceType":"Blizzard"},{"title":"Latest Developer Blog with Production Director Chris Sigaty","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/411448\/Latest_Developer_Blog_with_Production_Director_Chris_Sigaty-7_3_2012","postedDate":1341273600,"content":"In our last blog post, we outlined several upcoming online features we’re working on, including clans and groups, global play, resume from replay, multiplayer replay viewing, unranked matchmaking, and language packs. Since then, we've seen some speculation on whether the features would be exclusive to Heart of the Swarm or available to Wings of Liberty players. We want to clarify that all of these features will be available to BOTH Wings of Liberty and Heart of the Swarm owners. You will not be required to purchase Heart of the Swarm to get the benefits of these features.","sourceType":"Blizzard"},{"title":"Legends Speak Bisu, Stork, Jaedong, and Flash talk StarCraft II","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/411446\/Legends_Speak_Bisu_Stork_Jaedong_and_Flash_talk_StarCraft_II-7_3_2012","postedDate":1341273600,"content":"In the world of Korean professional StarCraft: Brood War, no one personifies “superstar” more than these four men: Kim “Bisu” Taek Young, Song “Stork” Byung Gu, Lee “Jaedong” Jae Dong, and Lee “Flash” Young Ho. Were it not for the other three, any one of these players would be unanimously considered the best in the world during their prime. These incredibly skilled players made the last years of Brood War possibly the most enthralling era of competition in that game’s history. Finally, at the MLG Spring Championship, they played StarCraft II on Western soil for the first time.","sourceType":"Blizzard"},{"title":"GSL and GSTL: Nonstop Action","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/411444\/GSL_and_GSTL_Nonstop_Action-7_3_2012","postedDate":1341273600,"content":"Each season of GSL seems to be better than the last. With some of the stiffest competition in GSL history, and upsets and nail biters as the order of the day, the Round of 16 has been nothing but can’t-miss StarCraft. If that wasn’t enough, the GSTL is as exciting as ever – with upstarts Fnatic and NS HoSeo shaking up the competition and proving they can hang with the favorites. You owe it to yourself to tune in.","sourceType":"Blizzard"},{"title":"WCS - New Zealand Nationals Recap","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/394713\/WCS_-_New_Zealand_Nationals_Recap_-6_14_2012","postedDate":1339632000,"content":"The WCS New Zealand Nationals took place on June 2, with the top eight StarCraft II players competing for the chance to represent their county at the Oceania finals on August 12.","sourceType":"Blizzard"},{"title":"Heart of the Swarm Update - New Videos","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/391471\/Heart_of_the_Swarm_Update_-_New_Videos-6_13_2012","postedDate":1339545600,"content":"A large number of StarCraft II: Heart of the Swarm demo stations will be featured at the MLG Spring Championship running June 8-10, where attendees can sit down to see the future of StarCraft II multiplayer first hand. We wanted to share the excitement with players who couldn’t be there in the flesh, so here’s a video featuring the latest updates to the Heart of the Swarm multiplayer units, and a battle report so you can see them in action.","sourceType":"Blizzard"},{"title":"Season 8 Has Begun","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/391469\/Season_8_Has_Begun-6_13_2012","postedDate":1339545600,"content":"The eighth StarCraft II League season has arrived!","sourceType":"Blizzard"},{"title":"Season 8 Map Pool Update","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/391468\/Season_8_Map_Pool_Update-6_8_2012","postedDate":1339113600,"content":"Season 8, which begins the week of June 11, will bring with it some changes to the 1v1 and 2v2 map pools. In season 7, we experimented with a larger 1v1 map pool.&#160; After reviewing player feedback, we’ll be returning to a pool of 8 maps. We will continue to maintain a heavy focus on tournament viable 1v1 maps, and that thought process has influenced our decisions regarding which maps will be removed from the ladder for Season 8.","sourceType":"Blizzard"},{"title":"Season 7 Now Locked","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/391470\/Season_7_Now_Locked-6_5_2012","postedDate":1338854400,"content":"Attention, StarCraft II ladder competitors! Season 7 is now locked.","sourceType":"Blizzard"},{"title":"The Patch 1.5.0 Arcade has begun","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=2blog\/282538\/_The_Patch_150_Arcade_has_begun-6_4_2012","postedDate":1338768000,"content":"The Patch 1.5.0 Beta introduces an entirely new Battle.net experience: the Arcade. The Arcade offers exciting new ways to find and play your favorite custom games -- and discover new favorites too.","sourceType":"Blizzard"},{"title":"NASL Heads up","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/282537\/NASL_Heads_up-6_4_2012","postedDate":1338768000,"content":"This season of NASL has been hard fought. After nearly eight weeks of matches, the division standings are beginning to take shape. This weekend will also see two fan favorites, SK.MC and Liquid`Sheth, go head to head in a showmatch at the Anthill Pub at UC Irvine.","sourceType":"Blizzard"},{"title":"World Championship Series: New Zealand Nationals - Updated","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/316999\/World_Championship_Series_New_Zealand_Nationals_-_Updated-5_22_2012","postedDate":1337644800,"content":"The next event in the StarCraft II World Championship Series are the New Zealand Nationals taking place in Auckland, New Zealand on June 2. Eight of the best StarCraft II players in the country will battle for glory, and the opportunity to represent New Zealand at the WCS Oceania Finals in August; a road that could lead to competing in the World Championship later this year!","sourceType":"Blizzard"},{"title":"Art of War - Upgrades","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/316998\/Art_of_War_-_Upgrades-5_17_2012","postedDate":1337212800,"content":"Strategy, tactics, and skill. At the heart of StarCraft II are the legion of skilled tacticians and brilliant strategists leading armies of zerg, protoss, and terrans to war across the scarred battlefields of the Koprulu Sector. Knowledge is power; the greatest commanders throughout history earned their victories not merely by virtue of strategic brilliance, but also by applying themselves to rigorous study of warfare and the tactics used by those who fought before them. You too can tap into this valuable resource, and that’s where StarCraft Art of War comes in.","sourceType":"Blizzard"},{"title":"Balance Update - 5.10.12","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/258555\/Balance_Update_-_51012-5_10_2012","postedDate":1336608000,"content":"You might have been part of helping us test the new balance changes coming to StarCraft II, and these most recent adjustments will be coming to the game very soon. What’s different is that, for the first time ever, they won’t be applied as part of a patch.","sourceType":"Blizzard"},{"title":"Developer Update with Production Director Chris Sigaty","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/256850\/Developer_Update_with_Production_Director_Chris_Sigaty-5_7_2012","postedDate":1336348800,"content":"Greetings fellow StarCraft II players! The past couple weeks have been amazing for the StarCraft II community. At the Dreamhack Open we saw the Swedish \"Spoon Terran,\" Thorzain, triumph over GSL champion Polt in front of a hometown crowd in an amazing series. That same weekend, the Major League Gaming Spring Arena finals went to best of 7 games to see DongRaeGu victorious against MarineKing, avenging a loss in the Winter Championship.","sourceType":"Blizzard"},{"title":"Call to Action: Balance Testing","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/254310\/Call_to_Action_Balance_Testing-5_3_2012","postedDate":1336003200,"content":"We’ve just published a new multiplayer map called \"Antiga Shipyard (1.4.3 Balance v2.0)\", in which we’re testing a few small balance changes to StarCraft II. Our hope is to bring the changes to the game in a week or so, without a full patch.","sourceType":"Blizzard"},{"title":"A Historic Moment in eSports","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/254309\/A_Historic_Moment_in_eSports_-5_2_2012","postedDate":1335916800,"content":"At a recent press conference in Korea, Blizzard Entertainment, the Korea eSports Association (KeSPA), Ongamenet, and GomTV have announced a new partnership that promises to change the StarCraft II eSports landscape in Korea.","sourceType":"Blizzard"},{"title":"We &lt;3 eSports!","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/251115\/We_3_eSports_-5_2_2012","postedDate":1335916800,"content":"With the launch of the StarCraft II World Championship Series, we’ve added a new section to StarCraft2.com dedicated entirely to eSports.","sourceType":"Blizzard"},{"title":"Heart of the Swarm at MLG","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/251114\/Heart_of_the_Swarm_at_MLG_-5_2_2012","postedDate":1335916800,"content":"We recently announced a partnership with Major League Gaming (MLG) for the World Championship Series. What we didn’t mention at the time was that we’ll be offering attendees a special opportunity play StarCraft II: Heart of the Swarm at the MLG Pro Circuit Spring Championship event, being held at the Anaheim Convention Center from June 8-10.","sourceType":"Blizzard"},{"title":"Highlight Reel - Wings of Dream (last fly) By Coyote","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/251113\/Highlight_Reel_-_Wings_of_Dream_last_fly_By_Coyote-4_30_2012","postedDate":1335744000,"content":"Featuring a very cool homage to a classic anime series and incredible action from some of the most exciting StarCraft II plays ever, this highlight reel does not disappoint","sourceType":"Blizzard"},{"title":"The Zerg Rush Google","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=3blog\/251112\/The_Zerg_Rush_Google-4_30_2012","postedDate":1335744000,"content":"Google has a surprise for you. You might be innocently googleing around, maybe searching for minerals, when you make the mistake of typing zerg rush into your search bar.","sourceType":"Blizzard"},{"title":"Talking Balance with David Kim","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/251110\/Talking_Balance_with_David_Kim-4_27_2012","postedDate":1335484800,"content":"Based on our internal data, tournament results, as well as the feedback we receive from pro-players and the community at large we believe that the balance between the StarCraft II races is in a good place. Still, we’re going keep a close eye on things to make sure that gameplay remains fun and balanced even as we prepare for the exciting changes that will come with Heart of the Swarm and beyond. In today’s report, we’re going to look at some recent shifts that might merit further investigation, where we are in terms of balance over all, as well as how things look in the pro scene","sourceType":"Blizzard"},{"title":"Ask Creative Development: Submit Your Questions","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/248435\/Ask_Creative_Development_Submit_Your_Questions-4_23_2012","postedDate":1335139200,"content":"The time has come for the Creative Development hive mind to delve into the vaults and answer your questions pertaining to the lore of the StarCraft universe. You stand at the brink of gaining true knowledge, but will you ask the question that the ancients will answer? Or will your question fall into the galactic abyss? Consider well what question you will ask because you are only allowed to put a single query before them. Then, return to the thread often and vote on the questions you would most like to see answered. Welcome to information by democracy.","sourceType":"Blizzard"},{"title":"World Championship Series - Australia Nationals &amp; Oceania Final (Updated)","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/231241\/World_Championship_Series_-_Australia_Nationals__Oceania_Final_Updated-4_23_2012","postedDate":1335139200,"content":"We're excited to bring you an update regarding Blizzard's new eSports competition: the StarCraft II World Championship Series!","sourceType":"Blizzard"},{"title":"World Championship Series Overview","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/237648\/World_Championship_Series_Overview_-4_17_2012","postedDate":1334620800,"content":"The StarCraft II World Championship Series is underway!","sourceType":"Blizzard"},{"title":"World Championship Series - Asia Nationals","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/237644\/World_Championship_Series_-_Asia_Nationals-4_12_2012","postedDate":1334188800,"content":"We're excited to bring you an update regarding Blizzard's new eSports competition: the StarCraft II World Championship Series","sourceType":"Blizzard"},{"title":"World Championship Series: South America Nationals","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/237647\/World_Championship_Series_South_America_Nationals_-4_12_2012","postedDate":1334188800,"content":"We're excited to bring you an update regarding Blizzard's new eSports competition: the StarCraft II World Championship Series.","sourceType":"Blizzard"},{"title":"World Championship Series - Europe Nationals","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/237645\/World_Championship_Series_-_Europe_Nationals-4_12_2012","postedDate":1334188800,"content":"We're excited to bring you an update regarding Blizzard's new eSports competition: the StarCraft II World Championship Series.","sourceType":"Blizzard"},{"title":"World Championship Series - North America Nationals","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/237646\/World_Championship_Series_-_North_America_Nationals_-4_12_2012","postedDate":1334188800,"content":"We're excited to bring you an update regarding Blizzard's new eSports competition: the StarCraft II World Championship Series.","sourceType":"Blizzard"},{"title":"Developer Update: Heart of the Swarm Multiplayer","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/231240\/Developer_Update_Heart_of_the_Swarm_Multiplayer-4_11_2012","postedDate":1334102400,"content":"We are currently working non-stop on StarCraft II: Heart of the Swarm and hope to be able to get it out to the public to see sometime in the near future.&#160; While we believe we have some great things lined up for the single-player campaign, I wanted to take some time to give you an update on the recent changes and what cool things we have in store for the multi-player.","sourceType":"Blizzard"},{"title":"The SEA\/ANZ Season 7 Has Begun","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/231239\/The_SEAANZ_Season_7_Has_Begun-4_10_2012","postedDate":1334016000,"content":"The seventh StarCraft II League season has arrived!","sourceType":"Blizzard"},{"title":"Upcoming Changes to Matchmaking","url":"http:\/\/sea.battle.net\/sc2\/en\/?page=4blog\/231238\/Upcoming_Changes_to_Matchmaking-4_10_2012","postedDate":1334016000,"content":"We’ve been closely monitoring the quality of our matchmaking since StarCraft II was released to make sure that the ladder offers the most exciting and finely tuned competitive experience possible.","sourceType":"Blizzard"}]