[{"title":"Your Guide to Patch 1.5.0 Arcade","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428179\/Your_Guide_to_Patch_150_Arcade-7_31_2012","postedDate":1343692800,"content":"Patch 1.5.0 Arcade has finally arrived, and it brings sweeping changes to the Battle.net experience. The new Arcade offers the StarCraft community an exciting new way to discover, rate, and play a wide array of community and Blizzard created games, as well as a plethora of options that will help you swiftly find the kinds of experiences you’re looking for. &#160;","sourceType":"Blizzard"},{"title":"Patch 1.5.0 Now Live","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428181\/Patch_150_Now_Live-7_31_2012","postedDate":1343692800,"content":"&#160;","sourceType":"Blizzard"},{"title":"What You Need To Know About Patching 1.5.0","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/428178\/What_You_Need_To_Know_About_Patching_150-7_30_2012","postedDate":1343606400,"content":"StarCraft II patch 1.5.0 is on the horizon and it’s bringing a number of changes to your StarCraft II Battle.net experience, including an entirely new custom game experience with Arcade, tons of new additions and improvements to the StarCraft II Editor, and streaming downloads to make patching even faster. We wanted to provide a little guidance so everyone is prepared and able to get into the game fast on patch day!","sourceType":"Blizzard"},{"title":"WCS Singapore Nationals this Weekend!","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/426745\/WCS_Singapore_Nationals_this_Weekend-7_27_2012","postedDate":1343347200,"content":"From July 28 to 29th, the top Singapore players will face off in the StarCraft II World Championship Series for the Singapore Nationals. Players will battle it out through the on-site qualifier tournaments on Day 1; and the top 16 players will fight for the top spot to qualify for the Asia to represent Singapore on Day 2. With a $10,000 prize pool, this is the biggest event Singapore has for StarCraft II!&#160;","sourceType":"Blizzard"},{"title":"WCS Singapore Finals Confirmed July 28-29","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/424974\/WCS_Singapore_Finals_Confirmed_July_28-29-7_25_2012","postedDate":1343174400,"content":"Blizzard Entertainment and the ESL will bring the best players in Southeast Asia together to compete at the StarCraft II World Championship Series (WCS) Singapore Nationals and the Southeast Asia Open. The combined event is set to take place in Singapore, July 28-29 at the Funan Main Atrium located inside Funan Digitalife Mall, City Hall.","sourceType":"Blizzard"},{"title":"GSL: Four Players, Four Teams","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421774\/GSL_Four_Players_Four_Teams-7_19_2012","postedDate":1342656000,"content":"Both the GOMTV StarCraft League and Team League are down to their last four competitors. In the individual league, terran hero ByunPrime takes on LG_IMSeed while GSL Champions SK.MC and MvPDongRaeGu fight it out for a shot at another trophy. This weekend, SlayerS-EG goes up against Team SCV Life and MVP faces FXOpen in the GSTL. If you haven’t watched yet this season, there’s no better time to jump in and cheer for your favorite.","sourceType":"Blizzard"},{"title":"ACL to Host WCS Australia National\/Oceania Finals","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421773\/ACL_to_Host_WCS_Australia_NationalOceania_Finals-7_18_2012","postedDate":1342569600,"content":"We’re pleased to announce our partnership with the Australian Cyber League to host the WCS Australia National and Oceania Finals the weekend of August 11th and 12th at the&#160;Australian Technology Park in Sydney.","sourceType":"Blizzard"},{"title":"Battle.net World Championship Headed to China","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/421225\/Battlenet_World_Championship_Headed_to_China-7_16_2012","postedDate":1342396800,"content":"We’ve just announced that the Battle.net World Championship event -- the culmination of the over 30 StarCraft II World Championship Series (WCS) tournaments, and home to the upcoming World of Warcraft Arena global finals -- will take place November 17 and 18 in Shanghai, China.","sourceType":"Blizzard"},{"title":"SEA\/ANZ StarCraft II Tournaments on the Horizon: Updated","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/216986\/SEAANZ_StarCraft_II_Tournaments_on_the_Horizon_Updated-7_10_2012","postedDate":1341878400,"content":"Think you have what it takes to compete in a local StarCraft II tournament? Various competition organizers hold regular tournaments where you can take on the toughest local competition for a chance at winning prizes. If you’re more of the spectator type, you can always join the audience and cheer on some of the best players in the region as they compete for glory. You might even learn a trick or two!","sourceType":"Blizzard"},{"title":"IPL Update: Team Leagues, Qualifers and Hot Imports","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/416560\/IPL_Update_Team_Leagues_Qualifers_and_Hot_Imports-7_10_2012","postedDate":1341878400,"content":"There’s always something going on in the IGN Proleague. Last weekend, in addition to the usual team league and Fight Club content, IPL put on a showmatch series at Hot Import Nights in San Francisco between four of the world’s best players. Now, the Team Arena Challenge is finally winding down: only the best of the best remain. Six teams will go home over the next two weeks, so be sure to cheer on your favorite.","sourceType":"Blizzard"},{"title":"New StarCraft Fan Art","url":"http:\/\/sea.battle.net\/sc2\/en\/blog\/416561\/New_StarCraft_Fan_Art-7_10_2012","postedDate":1341878400,"content":"The Blizzard Fan Art Section has been updated with two new pieces of fan artwork set within the StarCraft universe","sourceType":"Blizzard"}]